Tekla.Structures.ModelInternal.dotModelObjectType_t.PrimaryType
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotModelObjectType_t.SecondaryType
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotModelObjectType_t.BooleanPartType
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotModelObjectType_t.IsConcreteMaterial
DO NOT USE! For internal usage only!